[
  {
    "id": "the_inquisitor",
    "type": "GUN",
    "reload_noise_volume": 20,
    "name": { "str": "Inquisitor Hypervolocity Rail Accelerator" },
    "description": "The Inquisitor Hypervolocity Rail Accelerator is a weapon for the insane, unhinged, and truely desperate. Either due to insanity, genius, or the varius substances that you've recently ingested, you had the idea to construct this abomination. Days of work were put into assembling this behemoth, and it has definitely paid off. Requiring two full military plutonium fuel cells to fire a single shot, in addition to the 20000 UPS charge needed to jumpstart the weapon, it will leave nothing standing in its path of destruction. Firing a massive ferromagnetic slug at mach 34, equivalent to 26087.2 MPH or 41983.2 KM/H, the projectile exceeds Earth's escape velocity. As such, it matters little that said projectile is practically molten upon exiting the weapon. The Inquisitor has to be balanced on the shoulder, as it is simply to large to hold like a traditional rifle, and it's certainly not one. To prevent missing your target, the trajectory of the projectile is adjusted by the on-board targeting computer, ensuring that every shot hits its mark. The only question left is: Can you carry it?",
    "weight": "341475 g",
    "volume": "92000 ml",
	"longest_side": "362 cm",
    "price": 1000000000,
    "price_postapoc": 50000000,
    "to_hit": -3,
    "bashing": 40,
    "material": [ "steel", "superalloy", "plastic" ],
    "symbol": "[",
    "color": "dark_gray",
    "ammo": "heavy_slug_pack",
    "skill": "launcher",
    "range": 200,
    "ranged_damage": { "damage_type": "stab", "amount": 21500 },
    "dispersion": 0,
    "durability": 7,
    "clip_size": 1,
    "ups_charges": 20000,
    "reload": 5000,
    "valid_mod_locations": [
      [ "accessories", 3 ],
      [ "emitter", 1 ],
      [ "grip", 1 ],
      [ "rail", 2 ],
      [ "sights", 1 ],
      [ "sling", 1 ],
      [ "stock", 1 ],
      [ "underbarrel", 1 ]
    ],
    "ammo_effects": [ "INCENDIARY", "TRAIL", "LOW_RANGE_VAPORIZATION", "PLASMA", "EMP", "PLASMA_BUBBLE", "LASER", "FRAG", "NAPALM", "EXPLOSIVE_SMALL", "STREAM", "WIDE", "TANGLE", "STR_RELOAD", "WATERPROOF_GUN" ],
    "flags": [ "RELOAD_ONE" ]
  }
]
